---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetSeverity
source: html/e164b5f9-9b23-6cb6-c9ea-a57309aaabdf.htm
---
# Autodesk.Revit.DB.FailureMessage.GetSeverity Method

Retrieves the severity of the failure.

## Syntax (C#)
```csharp
public FailureSeverity GetSeverity()
```

## Returns
The severity of the failure.